<?xml version="1.0"?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data shape="1,3,160,80" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>80</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,C,H,W]" />
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="1" name="Gather_16699" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="0" size="12" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Subtract_1295" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Gather_16702" type="Const" version="opset1">
			<data element_type="f32" shape="32, 3, 3, 3" offset="12" size="3456" />
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Multiply_14621" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_14626" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="3468" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="626" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>39</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="626">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="627" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="627">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Multiply_15301" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 3, 3" offset="3596" size="36864" />
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Multiply_14628" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>39</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>77</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_14633" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="40460" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="629" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>77</dim>
					<dim>37</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="629">
					<dim>1</dim>
					<dim>32</dim>
					<dim>77</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="630" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>77</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="630">
					<dim>1</dim>
					<dim>32</dim>
					<dim>77</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Multiply_15310" type="Const" version="opset1">
			<data element_type="f32" shape="64, 32, 3, 3" offset="40588" size="73728" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Multiply_14635" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>77</dim>
					<dim>37</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>77</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_14640" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="114316" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="632" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>77</dim>
					<dim>37</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="632">
					<dim>1</dim>
					<dim>64</dim>
					<dim>77</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="633" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>77</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="633">
					<dim>1</dim>
					<dim>64</dim>
					<dim>77</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="634" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="3, 3" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>77</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="634">
					<dim>1</dim>
					<dim>64</dim>
					<dim>38</dim>
					<dim>18</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>64</dim>
					<dim>38</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Multiply_15319" type="Const" version="opset1">
			<data element_type="f32" shape="80, 64, 1, 1" offset="114572" size="20480" />
			<output>
				<port id="0" precision="FP32">
					<dim>80</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Multiply_14642" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>38</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>80</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>38</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_14647" type="Const" version="opset1">
			<data element_type="f32" shape="1, 80, 1, 1" offset="135052" size="320" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="636" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>38</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="636">
					<dim>1</dim>
					<dim>80</dim>
					<dim>38</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="637" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>38</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="637">
					<dim>1</dim>
					<dim>80</dim>
					<dim>38</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Multiply_15328" type="Const" version="opset1">
			<data element_type="f32" shape="192, 80, 3, 3" offset="135372" size="552960" />
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>80</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Multiply_14649" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>38</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>80</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_14654" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="688332" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="639" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="639">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="640" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="640">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="641" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="3, 3" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="641">
					<dim>1</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Multiply_15337" type="Const" version="opset1">
			<data element_type="f32" shape="64, 192, 1, 1" offset="689100" size="49152" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Multiply_14656" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_14661" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="738252" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="643" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="643">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="644" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="644">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Multiply_15346" type="Const" version="opset1">
			<data element_type="f32" shape="48, 192, 1, 1" offset="738508" size="36864" />
			<output>
				<port id="0" precision="FP32">
					<dim>48</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Multiply_14663" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_14668" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="775372" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="646" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="646">
					<dim>1</dim>
					<dim>48</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="647" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="647">
					<dim>1</dim>
					<dim>48</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Multiply_15355" type="Const" version="opset1">
			<data element_type="f32" shape="64, 48, 5, 5" offset="775564" size="307200" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>48</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Multiply_14670" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="2, 2" pads_end="2, 2" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>48</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_14675" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="1082764" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="649" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="649">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="650" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="650">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Multiply_15364" type="Const" version="opset1">
			<data element_type="f32" shape="64, 192, 1, 1" offset="1083020" size="49152" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Multiply_14677" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_14682" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="1132172" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="652" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="652">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="653" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="653">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Multiply_15373" type="Const" version="opset1">
			<data element_type="f32" shape="96, 64, 3, 3" offset="1132428" size="221184" />
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Multiply_14684" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_14689" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="1353612" size="384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="655" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="655">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="656" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="656">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Multiply_15382" type="Const" version="opset1">
			<data element_type="f32" shape="96, 96, 3, 3" offset="1353996" size="331776" />
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Multiply_14691" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Constant_14696" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="1685772" size="384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="658" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="658">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="659" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="659">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="661" type="AvgPool" version="opset1">
			<data kernel="3, 3" strides="1, 1" pads_begin="1, 1" pads_end="1, 1" exclude-pad="false" auto_pad="explicit" rounding_type="floor" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="661">
					<dim>1</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Multiply_15391" type="Const" version="opset1">
			<data element_type="f32" shape="32, 192, 1, 1" offset="1686156" size="24576" />
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Multiply_14698" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_14703" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="1710732" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="663" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="663">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="664" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="664">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="665" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="665">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Multiply_15400" type="Const" version="opset1">
			<data element_type="f32" shape="64, 256, 1, 1" offset="1710860" size="65536" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Multiply_14705" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_14710" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="1776396" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="667" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="667">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="668" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="668">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Multiply_15409" type="Const" version="opset1">
			<data element_type="f32" shape="48, 256, 1, 1" offset="1776652" size="49152" />
			<output>
				<port id="0" precision="FP32">
					<dim>48</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Multiply_14712" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_14717" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="1825804" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="670" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="670">
					<dim>1</dim>
					<dim>48</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="671" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="671">
					<dim>1</dim>
					<dim>48</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Multiply_15418" type="Const" version="opset1">
			<data element_type="f32" shape="64, 48, 5, 5" offset="1825996" size="307200" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>48</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Multiply_14719" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="2, 2" pads_end="2, 2" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>48</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_14724" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="2133196" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="673" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="673">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="674" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="674">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Multiply_15427" type="Const" version="opset1">
			<data element_type="f32" shape="64, 256, 1, 1" offset="2133452" size="65536" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Multiply_14726" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_14731" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="2198988" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="676" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="676">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="677" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="677">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Multiply_15436" type="Const" version="opset1">
			<data element_type="f32" shape="96, 64, 3, 3" offset="2199244" size="221184" />
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Multiply_14733" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_14738" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="2420428" size="384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="679" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="679">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="680" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="680">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Multiply_15445" type="Const" version="opset1">
			<data element_type="f32" shape="96, 96, 3, 3" offset="2420812" size="331776" />
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Multiply_14740" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_14745" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="2752588" size="384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="682" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="682">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="683" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="683">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="685" type="AvgPool" version="opset1">
			<data kernel="3, 3" strides="1, 1" pads_begin="1, 1" pads_end="1, 1" exclude-pad="false" auto_pad="explicit" rounding_type="floor" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="685">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Multiply_15454" type="Const" version="opset1">
			<data element_type="f32" shape="64, 256, 1, 1" offset="2752972" size="65536" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Multiply_14747" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_14752" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="2818508" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="687" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="687">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="688" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="688">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="689" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="689">
					<dim>1</dim>
					<dim>288</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Multiply_15463" type="Const" version="opset1">
			<data element_type="f32" shape="64, 288, 1, 1" offset="2818764" size="73728" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Multiply_14754" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>288</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Constant_14759" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="2892492" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="691" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="691">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="692" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="692">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Multiply_15472" type="Const" version="opset1">
			<data element_type="f32" shape="48, 288, 1, 1" offset="2892748" size="55296" />
			<output>
				<port id="0" precision="FP32">
					<dim>48</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Multiply_14761" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>288</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Constant_14766" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="2948044" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="694" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="694">
					<dim>1</dim>
					<dim>48</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="695" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="695">
					<dim>1</dim>
					<dim>48</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Multiply_15481" type="Const" version="opset1">
			<data element_type="f32" shape="64, 48, 5, 5" offset="2948236" size="307200" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>48</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Multiply_14768" type="Convolution" version="opset1">
